In [12]:
import numpy as np
import pandas as pd

In [14]:
df = pd.DataFrame(
       {
           "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
           "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
           "C": np.random.randn(8),
           "D": np.random.randn(8),
       }
   )
df

     A      B         C         D
0  foo    one -0.174864 -1.281346
1  bar    one -1.297484 -1.214100
2  foo    two -0.880372 -0.984589
3  bar  three -0.910061  0.853922
4  foo    two  0.455414  0.957810
5  bar    two -0.147626 -1.777839
6  foo    one  0.135075 -0.727439
7  foo  three -2.293951  0.334532

## Group By

In [21]:
type(df.groupby("A"))

pandas.core.groupby.generic.DataFrameGroupBy

In [15]:
df_A = df.groupby("A")[["C", "D"]].sum()
df_A

            C         D
A
bar -2.355171 -2.138018
foo -2.758697 -1.701031

In [16]:
df_A.index

Index(['bar', 'foo'], dtype='object', name='A')

In [17]:
df_AB = df.groupby(["A", "B"]).sum()
df_AB

                  C         D
A   B
bar one   -1.297484 -1.214100
    three -0.910061  0.853922
    two   -0.147626 -1.777839
foo one   -0.039789 -2.008785
    three -2.293951  0.334532
    two   -0.424957 -0.026779

In [18]:
df_AB.index

MultiIndex([('bar',   'one'),
            ('bar', 'three'),
            ('bar',   'two'),
            ('foo',   'one'),
            ('foo', 'three'),
            ('foo',   'two')],
           names=['A', 'B'])

In [19]:
df_CD = df.groupby("A")["C"].mean() + df.groupby("A")["D"].mean()
df_CD

A
bar   -1.497730
foo   -0.891946
dtype: float64

## Example of Grades

In [22]:
grades = pd.DataFrame(
       {
           "id": ["20240000", "20240000", "20240001", "20240001"],
           "course": ["Python", "Data Analysis", "Python", "Data Analysis"],
           "mid": [90, 100, 64, 88],
           "final": [76, 92, 78, 96],
       }
   )
grades

         id         course  mid  final
0  20240000         Python   90     76
1  20240000  Data Analysis  100     92
2  20240001         Python   64     78
3  20240001  Data Analysis   88     96

In [23]:
grades.groupby('id')[['mid', 'final']].mean()

           mid  final
id
20240000  95.0   84.0
20240001  76.0   87.0

In [24]:
grades.groupby('course')[['mid', 'final']].mean()

                mid  final
course
Data Analysis  94.0   94.0
Python         77.0   77.0

In [26]:
(grades.groupby('id')['mid'].mean() + grades.groupby('id')['final'].mean()) / 2

id
20240000    89.5
20240001    81.5
dtype: float64

In [28]:
grades.groupby('course')[['mid', 'final']].agg(['min', 'max'])

              mid      final
              min  max   min max
course
Data Analysis  88  100    92  96
Python         64   90    76  78